{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "roberta-base",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 4,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "score",
    "classifier",
    "score",
    "classifier",
    "score",
    "classifier",
    "score"
  ],
  "peft_type": "LORA",
  "r": 7,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query"
  ],
  "task_type": "SEQ_CLS",
  "use_dora": false,
  "use_rslora": false
}